[
  {
    "id": 1,
    "name": "Light rail",
    "description": "Light rail, which might be also known as trolley and streetcars, mean trains that function as local transit in an urban-core and can operate on the street-level. Compared to rapid transit, light rail costs less, is more pedestrian friendly, but has less passenger capacity. The major advantage with light rail is that it can operate like rapid transit or like local buses, depending on the available infrastructure",
    "distance-between-stop": "a few blocks to 1 or 2 miles",
    "max-speed": "55-65 mph",
    "sharing-tracks": true,
    "grade-crossing": false,
    "train-frequency": "3-30 minutes",
    "amenities": "n/a"
  },
  {
    "id": 2,
    "name": "Rapid transit",
    "description": "Rapid transit, which is also known as metro, subway, and heavy rail, mean trains that generally serve the urban-core, have large passenger capacity, and operate totally separate from road traffic. In order to run separately from road traffic in the city-core, rapid transit trains would run either above or underground.",
    "distance-between-stop": "1/2 mile to 2 or 3 miles",
    "max-speed": "65-70 mph",
    "sharing-tracks": false,
    "grade-crossing": false,
    "train-frequency": "3-20 minutes",
    "amenities": "Large space for standees"
  },
  {
    "id": 3,
    "name": "Commuter rail",
    "description": "Commuter trains generally mean trains connecting suburban areas with the central city and primarily serves riders to and from work. Commuter trains typically run on weekdays, during rush hours, and only in the peak directions.",
    "distance-between-stop": "1 to 2 miles",
    "max-speed": "79 mph",
    "sharing-tracks": true,
    "grade-crossing": true,
    "train-frequency": "15 minutes to hourly (some operate only during weekday peak hours)",
    "amenities": "Restroom"
  },
  {
    "id": 4,
    "name": "Inter-city rail",
    "description": "Inter-city trains generally mean trains traveling long distances connecting metropolitan areas. Although the distances covered by some of these trains are comparable to airlines, inter-city trains generally operate at highway speed. Long distance inter-city trains may provide amenities not found on most other forms of transportation, including sleeper-cars and cafe/dining cars.",
    "distance-between-stop": "2 to 10 miles",
    "max-speed": "79 mph",
    "sharing-tracks": true,
    "grade-crossing": true,
    "train-frequency": "Hourly to once a day, or even three trips a week.",
    "amenities": "Restroom, business class, sleeper (longer distance), cafe car, dining car"
  },
  {
    "id": 5,
    "name": "High speed rail",
    "description": "High speed trains are generally defined as trains that can operate 125mph or faster. High speed trains generally connect large metropolitan areas (with very few stops in between) and are meant to be competitive with airlines in terms of overall travel time.",
    "distance-between-stop": "at least 10 miles",
    "max-speed": "at least 90 mph",
    "sharing-tracks": false,
    "grade-crossing": false,
    "train-frequency": "15 minutes to hourly",
    "amenities": "Restroom, business class, cafe car"
  }
]